In [1]:
import numpy as np

In [2]:
np.array([3.14,1,2,3])

array([3.14, 1.  , 2.  , 3.  ])

In [3]:
np.array([1,2,3,4],dtype='float')

array([1., 2., 3., 4.])

In [4]:
np.array([ range(i,i+3) for i in [2,4,6]])

array([[2, 3, 4],
       [4, 5, 6],
       [6, 7, 8]])

In [5]:
np.zeros([5,2])

array([[0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

In [6]:
np.ones([3,4])

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [7]:
np.full([3,3],3.14)

array([[3.14, 3.14, 3.14],
       [3.14, 3.14, 3.14],
       [3.14, 3.14, 3.14]])

In [8]:
np.arange(0,10,3)

array([0, 3, 6, 9])

In [9]:
np.random.randint(0,10,(2,3))

array([[7, 5, 8],
       [9, 7, 9]])

In [10]:
np.random.seed(0)
x1 = np.random.randint(10, size=6)
x2 = np.random.randint(10, size=(3,4))
x3 = np.random.randint(10,size=(3,4,5))
x3

array([[[8, 1, 5, 9, 8],
        [9, 4, 3, 0, 3],
        [5, 0, 2, 3, 8],
        [1, 3, 3, 3, 7]],

       [[0, 1, 9, 9, 0],
        [4, 7, 3, 2, 7],
        [2, 0, 0, 4, 5],
        [5, 6, 8, 4, 1]],

       [[4, 9, 8, 1, 1],
        [7, 9, 9, 3, 6],
        [7, 2, 0, 3, 5],
        [9, 4, 4, 6, 4]]])

In [11]:
x3.ndim

3

In [12]:
x2.ndim

2

In [13]:
x2.shape

(3, 4)

In [14]:
x2.size

12

In [15]:
l = [1,2,3,4,5,6]
for i in range(0,len(l),-1):
    print(i)

In [16]:
x1[0]

5

In [17]:
x2

array([[3, 5, 2, 4],
       [7, 6, 8, 8],
       [1, 6, 7, 7]])

In [18]:
x2[1,1]

6

In [19]:
x= np.arange(10)
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [20]:
x[5:]

array([5, 6, 7, 8, 9])

In [21]:
x[::3]

array([0, 3, 6, 9])

In [22]:
x[::-1]

array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])

In [23]:
x2

array([[3, 5, 2, 4],
       [7, 6, 8, 8],
       [1, 6, 7, 7]])

In [24]:
x2[:2,:3]

array([[3, 5, 2],
       [7, 6, 8]])

In [25]:
x2[:2,::2]

array([[3, 2],
       [7, 8]])

In [26]:
b = np.arange(1,10)
b

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [27]:
b.reshape(3,3)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [28]:
x = np.array([1,2,3])
y = np.array([4,5,6])
np.concatenate([x,y])

array([1, 2, 3, 4, 5, 6])

In [29]:
x = np.array([1, 2, 3])
grid = np.array([[9, 8, 7],
                  [6, 5, 4]])

In [30]:
np.vstack([x,grid])

array([[1, 2, 3],
       [9, 8, 7],
       [6, 5, 4]])

In [31]:
import pandas as pd

In [32]:
data = pd.Series([1,2,3,4,5,6])

In [33]:
data

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [34]:
data.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [35]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [36]:
data[1]

2

In [37]:
pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [38]:
d = {'California': 38332521,
 'Texas': 26448193,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}
pd.Series(d)

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [39]:
pd.Series(5,index=[1,2,3,4])

1    5
2    5
3    5
4    5
dtype: int64

In [40]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [41]:
data['a']

0.25

In [42]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [43]:
data[:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [44]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [45]:
data[(data>0.25) &
     (data<1.00)]

b    0.50
c    0.75
dtype: float64

In [46]:
area = pd.Series({'California': 423967, 'Texas': 695662,
 'New York': 141297, 'Florida': 170312,
 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
 'New York': 19651127, 'Florida': 19552860,
 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [47]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [48]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [49]:
data['density'] =  data['pop'] / data['area']

In [50]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [51]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [52]:
data.loc[:'New York',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [53]:
data.loc[data['area']>170311,:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
Florida     170312  19552860

In [54]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [55]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [56]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [57]:
data.loc[data.isnull()]

1     NaN
3    None
dtype: object

In [58]:
data.loc[data.notnull()]

0        1
2    hello
dtype: object

In [59]:
data.dropna()

0        1
2    hello
dtype: object

In [60]:
df = pd.DataFrame([[1, np.nan, 2],
 [2, 3, 5],
 [np.nan, 4, 6]])
df.head()

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [61]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [62]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [63]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [64]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [65]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [66]:
def make_df(cols, ind):
 """Quickly make a DataFrame"""
 data = {c: [str(c) + str(i) for i in ind]
 for c in cols}
 return pd.DataFrame(data, ind)
 # example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [67]:
x=[1,2]
y=[3,4,5]
np.concatenate([x,y])

array([1, 2, 3, 4, 5])

In [68]:
x=[[1,2],[3,4]]
print(x)

[[1, 2], [3, 4]]

In [69]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [70]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AC', [3, 4])

In [71]:
df1

    A   B
1  A1  B1
2  A2  B2

In [72]:
df2

    A   C
3  A3  C3
4  A4  C4

In [73]:
pd.concat([df1,df2])

    A    B    C
1  A1   B1  NaN
2  A2   B2  NaN
3  A3  NaN   C3
4  A4  NaN   C4

In [74]:
pd.concat([df1,df2],join_axes=['A','B'])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [ ]:
df1.append(df2)

In [82]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue','praveen'],
 'group': ['Accounting', 'Engineering', 'Engineering', 'HR','tech']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue','sahasra'],
 'hire_date': [2004, 2008, 2012, 2014,2022]})

In [83]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4  praveen         tech

In [84]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
4  sahasra       2022

In [85]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [79]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
 'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [80]:
pd.merge(df3,df4)

NameError: name 'df3' is not defined

In [86]:
pd.merge(df1,df2,left_on='employee',right_on='employee',how='outer',suffixes=['L','R'])

  employee        group  hire_date
0      Bob   Accounting     2008.0
1     Jake  Engineering     2012.0
2     Lisa  Engineering     2004.0
3      Sue           HR     2014.0
4  praveen         tech        NaN
5  sahasra          NaN     2022.0

In [87]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [89]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [90]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [91]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [95]:
merge = pd.merge(pop,abbrevs,how='outer',left_on='state/region',right_on='abbreviation')
merge.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [96]:
merge.isnull().sum()

state/region     0
ages             0
year             0
population      20
state           96
abbreviation    96
dtype: int64

In [97]:
merge.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
abbreviation     True
dtype: bool

In [100]:
merge.loc[merge['population'].isnull(),'state/region'].unique()

array(['PR'], dtype=object)

In [101]:
merge.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [102]:
merge.query("year==2012")

     state/region     ages  year   population    state abbreviation
0              AL  under18  2012    1117489.0  Alabama           AL
1              AL    total  2012    4817528.0  Alabama           AL
94             AK  under18  2012     188162.0   Alaska           AK
95             AK    total  2012     730307.0   Alaska           AK
96             AZ  under18  2012    1617149.0  Arizona           AZ
...           ...      ...   ...          ...      ...          ...
2401           WY  under18  2012     136526.0  Wyoming           WY
2494           PR  under18  2012     841740.0      NaN          NaN
2495           PR    total  2012    3651545.0      NaN          NaN
2542          USA  under18  2012   73708179.0      NaN          NaN
2543          USA    total  2012  313873685.0      NaN          NaN

[106 rows x 6 columns]

In [105]:
merge.set_index('state').head()

        state/region     ages  year  population abbreviation
state
Alabama           AL  under18  2012   1117489.0           AL
Alabama           AL    total  2012   4817528.0           AL
Alabama           AL  under18  2010   1130966.0           AL
Alabama           AL    total  2010   4785570.0           AL
Alabama           AL  under18  2011   1125763.0           AL

In [107]:
merge.sort_values(ascending=True)

TypeError: sort_values() missing 1 required positional argument: 'by'

In [108]:
import seaborn as sns

In [109]:
pl = sns.load_dataset('planets')
pl.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [110]:
pl.mass.sum()

1353.37638

In [112]:
rng = np.random.RandomState(42)
df = pd.DataFrame({'A': rng.rand(5), 'B': rng.rand(5)})
df

          A         B
0  0.374540  0.155995
1  0.950714  0.058084
2  0.731994  0.866176
3  0.598658  0.601115
4  0.156019  0.708073

In [113]:
df.mean()

A    0.562385
B    0.477888
dtype: float64

In [114]:
pl.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [116]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
 'data': range(6)})#, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [117]:
df.groupby('key')

In [118]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [119]:
pl.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [121]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
 'data1': range(6),
 'data2': rng.randint(0, 10, 6)},
 columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [124]:
df.groupby('key')['data1'].mean()

key
A    1.5
B    2.5
C    3.5
Name: data1, dtype: float64

In [125]:
df.groupby('key').aggregate(['min','max'])

    data1     data2
      min max   min max
key
A       0   3     3   5
B       1   4     0   7
C       2   5     3   9

In [127]:
df.groupby('key')['data2'].std()>4

key
A    False
B     True
C     True
Name: data2, dtype: bool

In [128]:
def filter_func(x):
    return x['data2'].std() > 4
print(df.groupby('key').filter(filter_func))

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [134]:
df.filter[df.groupby('key')['data2'].std()>4]

TypeError: 'method' object is not subscriptable

In [137]:
df.groupby('key').transform(lambda x: x.mean()-x)

   data1  data2
0    1.5   -1.0
1    1.5    3.5
2    1.5    3.0
3   -1.5    1.0
4   -1.5   -3.5
5   -1.5   -3.0

In [138]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [143]:
df['data2']= df['data2'].transform(lambda x: x+100)

In [144]:
df

  key  data1  data2
0   A      0    105
1   B      1    100
2   C      2    103
3   A      3    103
4   B      4    107
5   C      5    109

In [145]:
df['data1']= df['data1'].apply(lambda x:x+2+220)
df

  key  data1  data2
0   A    222    105
1   B    223    100
2   C    224    103
3   A    225    103
4   B    226    107
5   C    227    109

In [147]:
tit = sns.load_dataset('titanic')
tit.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [151]:
tit.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [152]:
tit.groupby(['sex','class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [153]:
tit.groupby(['sex','class'])['survived'].mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [154]:
tit.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [160]:
age =  pd.cut(tit['age'],[0,18,40,80])
age

0      (18.0, 40.0]
1      (18.0, 40.0]
2      (18.0, 40.0]
3      (18.0, 40.0]
4      (18.0, 40.0]
           ...
886    (18.0, 40.0]
887    (18.0, 40.0]
888             NaN
889    (18.0, 40.0]
890    (18.0, 40.0]
Name: age, Length: 891, dtype: category
Categories (3, interval[int64, right]): [(0, 18] < (18, 40] < (40, 80]]

In [161]:
tit.pivot_table('survived',index=['sex',age],columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 40]  0.979167  0.914894  0.480000
       (40, 80]  0.961538  0.846154  0.111111
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 40]  0.478261  0.063492  0.146199
       (40, 80]  0.280000  0.095238  0.064516

In [165]:
tit.pivot_table(index='sex', columns='class',aggfunc={'survived':'sum'})

       survived
class     First Second Third
sex
female       91     70    72
male         45     17    47

In [1]:
import pandas as pd 
import numpy as np

In [2]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
 'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [5]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [6]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [7]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [8]:
df = pd.DataFrame({'name': monte,
 'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C',
 'B|C|D']})
df

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idle    B|D
4     Terry Jones    B|C
5   Michael Palin  B|C|D

In [10]:
df['info'].str.get_dummies()

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0
5  0  1  1  1

In [11]:
from datetime import datetime

In [12]:
datetime

datetime.datetime

In [13]:
datetime(2015,7,4)

datetime.datetime(2015, 7, 4, 0, 0)

In [15]:
from dateutil import parser

In [16]:
parser.parse('4th of July, 2015')

datetime.datetime(2015, 7, 4, 0, 0)

In [19]:
d = parser.parse('4th of July, 2015')
d.strftime('%y')

'15'

In [21]:
d.strftime('%m')

'07'

In [22]:
d.strftime('%A')

'Saturday'

In [23]:
date =  np.array('2020-07-14',dtype=np.datetime64)
date

array('2020-07-14', dtype='datetime64[D]')

In [24]:
date+np.arange(24)

array(['2020-07-14', '2020-07-15', '2020-07-16', '2020-07-17',
       '2020-07-18', '2020-07-19', '2020-07-20', '2020-07-21',
       '2020-07-22', '2020-07-23', '2020-07-24', '2020-07-25',
       '2020-07-26', '2020-07-27', '2020-07-28', '2020-07-29',
       '2020-07-30', '2020-07-31', '2020-08-01', '2020-08-02',
       '2020-08-03', '2020-08-04', '2020-08-05', '2020-08-06'],
      dtype='datetime64[D]')

In [25]:
np.array([1,2,3])

array([1, 2, 3])

In [26]:
np.datetime64('2022-12-16')

numpy.datetime64('2022-12-16')

In [27]:
date = pd.to_datetime('4th July ,2025')

In [28]:
date

Timestamp('2025-07-04 00:00:00')

In [29]:
date+pd.to_timedelta(np.arange(12),'D')

DatetimeIndex(['2025-07-04', '2025-07-05', '2025-07-06', '2025-07-07',
               '2025-07-08', '2025-07-09', '2025-07-10', '2025-07-11',
               '2025-07-12', '2025-07-13', '2025-07-14', '2025-07-15'],
              dtype='datetime64[ns]', freq=None)

In [32]:
date+pd.to_timedelta(np.arange(10),'s')

DatetimeIndex(['2025-07-04 00:00:00', '2025-07-04 00:00:01',
               '2025-07-04 00:00:02', '2025-07-04 00:00:03',
               '2025-07-04 00:00:04', '2025-07-04 00:00:05',
               '2025-07-04 00:00:06', '2025-07-04 00:00:07',
               '2025-07-04 00:00:08', '2025-07-04 00:00:09'],
              dtype='datetime64[ns]', freq=None)

In [35]:
s = pd.Series([0,1,2,3],index=pd.DatetimeIndex(['2025-01-01','2025-01-02','2025-01-03','2025-01-04']))
s

2025-01-01    0
2025-01-02    1
2025-01-03    2
2025-01-04    3
dtype: int64

In [36]:
s['2025-01-01':'2025-01-03']

2025-01-01    0
2025-01-02    1
2025-01-03    2
dtype: int64

In [38]:
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.rand(1000, 3), columns=['A', 'B', 'C'])
df

            A         B         C
0    0.374540  0.950714  0.731994
1    0.598658  0.156019  0.155995
2    0.058084  0.866176  0.601115
3    0.708073  0.020584  0.969910
4    0.832443  0.212339  0.181825
..        ...       ...       ...
995  0.967035  0.051669  0.504796
996  0.718454  0.862640  0.179256
997  0.800003  0.552707  0.396554
998  0.131715  0.865296  0.157273
999  0.309788  0.290046  0.871414

[1000 rows x 3 columns]

In [39]:
df1, df2, df3, df4, df5 = (pd.DataFrame(rng.randint(0, 1000, (100, 3)))
 for i in range(5))

In [40]:
df1.head()

     0    1    2
0  882  312  996
1  839  518  205
2  951  374  450
3  625  783  594
4  178  209  499

In [41]:
df2.head()

     0    1    2
0  679  419  625
1  251  618  548
2  334   91  529
3  865   62  661
4  511  138  697

In [43]:
df3 = pd.eval('df1*df2')
df3.head()

        0       1       2
0  598878  130728  622500
1  210589  320124  112340
2  317634   34034  238050
3  540625   48546  392634
4   90958   28842  347803

In [44]:
df2.head()

     0    1    2
0  679  419  625
1  251  618  548
2  334   91  529
3  865   62  661
4  511  138  697

In [45]:
df2.query('0 >10')

KeyError: False